What you provided is not an `rancher2_app_v2` resource definition. The title is mentioning app v2, and i was talking about it. What app are you talking about, `rancher2_app` or `rancher2_app_v2`??

This would be the app_v2 definition with the data you provided

```
resource "rancher2_app_v2" "foo" {
  cluster_id = <redacted>
  name = "nexus-test"
  namespace = "default"
  repo_name = "sonartype"
  chart_name = "nexus-repository-manager"
  chart_version = "34.1.0"
  values = <<EOF
ingress:
  enabled: true
  tls:
    # This should be a list, but I'm writing it as a map
    secretName: example-crt
    hosts:
    # also should be a list, but also purposefully wrong for this example
      nexus.example.com
EOF
}
```

Result from the provider, the app operation result

```
terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_app_v2.foo will be created
  + resource "rancher2_app_v2" "foo" {
      + annotations                 = (known after apply)
      + chart_name                  = "nexus-repository-manager"
      + chart_version               = "34.1.0"
      + cleanup_on_fail             = false
      + cluster_id                  = <redacted>
      + cluster_name                = (known after apply)
      + disable_hooks               = false
      + disable_open_api_validation = false
      + force_upgrade               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "nexus-test"
      + namespace                   = "default"
      + repo_name                   = "sonartype"
      + system_default_registry     = (known after apply)
      + values                      = <<~EOT
            ingress:
              enabled: true
              tls:
                # This should be a list, but I'm writing it as a map
                secretName: example-crt
                hosts:
                # also should be a list, but also purposefully wrong for this example
                  nexus.example.com
        EOT
      + wait                        = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_app_v2.foo: Creating...

Error: [ERROR] installing App V2: helm install --namespace=default --timeout=10m0s --values=/home/shell/helm/values-nexus-repository-manager-34.1.0.yaml --version=34.1.0 --wait=true nexus-test /home/shell/helm/nexus-repository-manager-34.1.0.tgz
coalesce.go:203: warning: destination for tls is a table. Ignoring non-table value []
Error: template: nexus-repository-manager/templates/ingress.yaml:25:16: executing "nexus-repository-manager/templates/ingress.yaml" at <.hosts>: can't evaluate field hosts in type interface {}


  on cattle.tf line 3, in resource "rancher2_app_v2" "foo":
   3: resource "rancher2_app_v2" "foo" {
```